app/controllers/errors_controller.rb

INSERT INTO "wrongs" ("created_at", "updated_at", "url") VALUES (?, ?, ?)  [["created_at", "2014-07-04 11:20:24.729198"], ["updated_at", "2014-07-04 11:20:24.729198"], ["url", "http://0.0.0.0:3000/anand/singh"]]
SELECT  "wrongs".* FROM "wrongs"  WHERE "wrongs"."url" = 'http://0.0.0.0:3000/asjkdfhksjadfh' LIMIT 1
---
  def catch_404
    @wrong=Wrong.find_or_create_by(url: request.original_url)